{
  "alora_invocation_tokens": null,
  "alpha_pattern": {},
  "arrow_config": null,
  "auto_mapping": {
    "base_model_class": "SmolVLAPolicy",
    "parent_library": "lerobot.policies.smolvla.modeling_smolvla"
  },
  "base_model_name_or_path": "lerobot/smolvla_base",
  "bias": "none",
  "corda_config": null,
  "ensure_weight_tying": false,
  "eva_config": null,
  "exclude_modules": null,
  "fan_in_fan_out": false,
  "inference_mode": true,
  "init_lora_weights": true,
  "layer_replication": null,
  "layers_pattern": null,
  "layers_to_transform": null,
  "loftq_config": {},
  "lora_alpha": 64,
  "lora_bias": false,
  "lora_dropout": 0.05,
  "lora_ga_config": null,
  "megatron_config": null,
  "megatron_core": "megatron.core",
  "modules_to_save": [
    "action_out_proj"
  ],
  "peft_type": "LORA",
  "peft_version": "0.19.1",
  "qalora_group_size": 16,
  "r": 64,
  "rank_pattern": {},
  "revision": null,
  "target_modules": "(model\\.vlm_with_expert\\.(lm_expert\\..*\\.(q|k|v|o|gate|up|down)_proj|vlm\\.model\\.vision_model\\.encoder\\.layers\\..*\\.self_attn\\.(q|k|v|out)_proj)|model\\.(state_proj|action_in_proj|action_out_proj|action_time_mlp_in|action_time_mlp_out))",
  "target_parameters": null,
  "task_type": null,
  "trainable_token_indices": null,
  "use_bdlora": null,
  "use_dora": false,
  "use_qalora": false,
  "use_rslora": false
}